[
  { "ring": "adopt", "quadrant": "Tools", "name": "eslint", "isNew": "FALSE", "description": "ESLint is an open-source JavaScript linting utility. Linting is a process that runs a program that will analyze code for potential errors. ESLint helps developers find and fix problems in their JavaScript code without executing it. It checks for common syntax and stylistic errors, such as missing semicolons, unused variables, inconsistent indentation, etc. ESLint is highly configurable, allowing developers to specify their own linting rules. It also includes a pluggable architecture for extending its capabilities. This means you can use plugins to create and manage your own rules to enforce specific coding standards and conventions. ESLint supports both ECMAScript 2015 (ES6) and JSX syntax out of the box, making it a popular choice for developers working with modern JavaScript frameworks like React and Vue.js." },
  { "ring": "adopt", "quadrant": "languages & frameworks", "name": "TypeScript",  "isNew": "FALSE", "description": "TypeScript is an open-source programming language developed and maintained by Microsoft. It's a strict syntactical superset of JavaScript, which means any existing JavaScript programs are also valid TypeScript programs." },
  { "ring": "trial", "quadrant": "Techniques", "name": "SPA", "isNew": "FALSE", "description": "A Single Page Application (SPA) is a type of web application that loads a single HTML page and dynamically updates that page as the user interacts with the app. SPAs work inside a browser and require no page reloading during use, which tends to result in a more fluid, user-friendly experience." },
  { "ring": "assess", "quadrant": "Platforms & infrastructure", "name": "Vercel", "isNew": "TRUE", "description": "Vercel is a cloud platform for static sites and Serverless Functions that fits perfectly with modern frameworks such as Next.js, React, Angular, and Vue.js. It enables developers to host websites and web services that deploy instantly and scale automatically, all without any configuration." }
]
